vacations/src/Documents/МС_ЗаявкаНаОтпуск/МС_ЗаявкаНаОтпуск.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МС_ЗаявкаНаОтпуск</name>
  <registerRecords>InformationRegister.МС_ГрафикОтпусков</registerRecords>
  <attributes>
    <name>Вид</name>
    <type>
      <types>EnumRef.МС_ВидыОтпусков</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.МС_СтатусыЗаявкиНаОтпуск</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

vacations/src/InformationRegisters/МС_ГрафикОтпусков/МС_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МС_ГрафикОтпусков</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.МС_СтатусыЗаявкиНаОтпуск</types>
    </type>
  </resources>
  <resources>
    <name>ВидОтпуска</name>
    <type>
      <types>EnumRef.МС_ВидыОтпусков</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДеньПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

vacations/src/InformationRegisters/МС_УровеньДоступаКЗаявкамНаОтпуск/МС_УровеньДоступаКЗаявкамНаОтпуск.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МС_УровеньДоступаКЗаявкамНаОтпуск</name>
  <resources>
    <name>ИмеетПравоНаСогласование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИмеетПравоНаУтверждение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИмеетПравоНаВыполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИмеетПравоНаОтмену</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

vacations/src/Enums/МС_СтатусыЗаявкиНаОтпуск/МС_СтатусыЗаявкиНаОтпуск.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МС_СтатусыЗаявкиНаОтпуск</name>
  <enumValues>
    <name>Заявка</name>
  </enumValues>
  <enumValues>
    <name>Согласована</name>
  </enumValues>
  <enumValues>
    <name>Утверждена</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
</mdclass:Enum>

vacations/src/Documents/МС_ЗаявкаНаОтпуск/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТекПользователь = Пользователи.ТекущийПользователь();
	Сотрудник = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекПользователь, "ФизическоеЛицо");
	Статус = Перечисления.МС_СтатусыЗаявкиНаОтпуск.Заявка;
	
	Ответственный = ТекПользователь;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	НачДата = НачалоДня(ДатаНачала);
	
	Движения.МС_ГрафикОтпусков.Записывать = Истина;
	
	Пока НачДата <= НачалоДня(ДатаОкончания) Цикл
		
		НовЗапись = Движения.МС_ГрафикОтпусков.Добавить();
		НовЗапись.Период 		= Дата;
		НовЗапись.Сотрудник 	= Сотрудник;
		НовЗапись.Статус 		= Статус;
		НовЗапись.ДеньПериода 	= НачДата;
		НовЗапись.ВидОтпуска	= Вид;
		
		НачДата = НачалоДня(КонецДня(НачДата) + 100);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если НачалоДня(ДатаНачала) > НачалоДня(ДатаОкончания) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			"Дата начала не может быть больше даты окончания",
			,
			"ДатаНачала",
			,
			Отказ);
	КонецЕсли;
	
	Если Пользователи.РолиДоступны("РасширенныйДоступКЗаявкамНаОтпуск")
		ИЛИ Пользователи.ЭтоПолноправныйПользователь() Тогда
		
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РС.Пользователь КАК Пользователь,
		|	РС.ИмеетПравоНаСогласование КАК ИмеетПравоНаСогласование,
		|	РС.ИмеетПравоНаУтверждение КАК ИмеетПравоНаУтверждение,
		|	РС.ИмеетПравоНаОтмену КАК ИмеетПравоНаОтмену,
		|	РС.ИмеетПравоНаВыполнение КАК ИмеетПравоНаВыполнение
		|ИЗ
		|	РегистрСведений.МС_УровеньДоступаКЗаявкамНаОтпуск КАК РС
		|ГДЕ
		|	РС.Пользователь = &Пользователь";
		
		Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
		
		СписокДоступныхСтатусов = Новый Массив;
		СписокДоступныхСтатусов.Добавить(Перечисления.МС_СтатусыЗаявкиНаОтпуск.Заявка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.ИмеетПравоНаСогласование Тогда
				СписокДоступныхСтатусов.Добавить(Перечисления.МС_СтатусыЗаявкиНаОтпуск.Согласована);
			КонецЕсли;
			Если Выборка.ИмеетПравоНаУтверждение Тогда
				СписокДоступныхСтатусов.Добавить(Перечисления.МС_СтатусыЗаявкиНаОтпуск.Утверждена);
			КонецЕсли;
			Если Выборка.ИмеетПравоНаВыполнение Тогда
				СписокДоступныхСтатусов.Добавить(Перечисления.МС_СтатусыЗаявкиНаОтпуск.Выполнена);
			КонецЕсли;
			Если Выборка.ИмеетПравоНаОтмену Тогда
				СписокДоступныхСтатусов.Добавить(Перечисления.МС_СтатусыЗаявкиНаОтпуск.Отменена);
			КонецЕсли;

		КонецЕсли;

		Если СписокДоступныхСтатусов.Найти(Статус) = Неопределено Тогда
			ОбщегоНазначения.СообщитьПользователю(
				"Нет прав доступа на указанный статус",
				,
				"Статус",
				,
				Отказ);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЧислоСекунд = (КонецДня(ДатаОкончания) - НачалоДня(ДатаНачала)) + 1;
	Длительность = ЧислоСекунд / (24*60*60);
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Префикс = "БР-";
КонецПроцедуры

#КонецОбласти

#КонецЕсли
